Revit 2024 API
ReferencePoint.GetHubId Method
Id of associated Hub.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementId GetHubId()
Visual Basic
Public Function GetHubId As ElementId
Visual C++
public:
ElementId^ GetHubId()
See Also
ReferencePoint Class
Autodesk.Revit.DB Namespace